Documents/БольшаяЯчеистаяСборка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>БольшаяЯчеистаяСборка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвижениеТары</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТарыПоШК</xr:Item>
				<xr:Item>AccumulationRegister.ЗонаОтгрузки</xr:Item>
				<xr:Item>InformationRegister.РегТарыПоШК</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Возврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходитВКомплект</Name>
					<Comment>Данный Документ входит в комплектом сборок</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументСписания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеТовараСЗоныОтгрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКоробокПриПроверке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектБЯС</Name>
					<Comment>Документ комплект в котый входит данная сборка</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коробки</Name>
					<Comment>Количество коробок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПоказыватьВСписке</Name>
					<Comment>Не показывать в списке НЕ РАСПРЕДЕЛЕННЫХ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомераСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийОбъем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПогрузкаВАвто</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПогрузкаТоваровВАвтомобиль</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПутевойЛист_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшивкиРаспечатанны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реестр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реестр</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Самовывоз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатыРаспечатаны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСборки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеСборки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Списан</Name>
					<Comment>Списание товара с зоны отгрузки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокМестХранений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СформированВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКомплект</Name>
					<Comment>Данный Документ Является комплектом сборок</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолТара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратВодителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратПоставщику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдресаДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыРасхода</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Док</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетФ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проверен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолПозиций</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АдресаДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МестаОтгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МестоОтгрузки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКоробок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыКомплекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокБЯС</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Тара</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контейнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Тара</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЗонаОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ЗонаОтгрузки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКоробок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерМестаОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПрихода</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/БольшаяЯчеистаяСборка/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//************* КОМПЛЕКТ **********************//
	//Если ЭтоКомплект - то Формируем Комплект
	 Если ЭтоКомплект Тогда
		 Если ДокументыКомплекта.Количество() >0 Тогда
			//Группируем по ДокКомплекта чтобы не было задвоений
			ТЗ=ДокументыКомплекта.Выгрузить();
			ТЗ.Свернуть("ДокБЯС");
			ДокументыКомплекта.Загрузить(ТЗ);
			//Проверяем что у них один Контрагент
			Контрагент=ДокументыКомплекта[0].ДокБЯС.Получатель;
			Для Каждого стр_БЯС Из ДокументыКомплекта Цикл
				Если Контрагент<>стр_БЯС.ДокБЯС.Получатель Тогда
					Сообщить("Нельзя создать комплект для разных клиентов.");
					Отказ=Истина;
					Возврат;
				КонецЕсли;
				
			КонецЦикла;
			НачатьТранзакцию();
			//***** Формируем комплект *********//
			Получатель=Контрагент;
			Организация=ДокументыКомплекта[0].ДокБЯС.Организация;
			МестаОтгрузки.Очистить();
			ДокументыРасхода.Очистить();
			Для Каждого стр_БЯС Из ДокументыКомплекта Цикл
				док_БЯС=стр_БЯС.ДокБЯС;
				//Заполняем ТЧ  МестаОтгрузки
				Для Каждого стр_ТЧ_док_БЯС из док_БЯС.МестаОтгрузки Цикл
					Если  док_БЯС.Возврат тогда
						СтрММ="";
						Для Каждого стр_Место из МестаОтгрузки Цикл
							Если стр_Место.МестоОтгрузки.Наименование="А01"  тогда
								СтрММ="А01";
							КонецЕсли;	
						КонецЦикла;	
						Если СтрММ="" тогда
							новаяСтрока=МестаОтгрузки.Добавить();
							новаяСтрока.МестоОтгрузки=стр_ТЧ_док_БЯС.МестоОтгрузки;
							новаяСтрока.КоличествоКоробок=стр_ТЧ_док_БЯС.КоличествоКоробок;
						КонецЕсли;	
					Иначе
						новаяСтрока=МестаОтгрузки.Добавить();
						новаяСтрока.МестоОтгрузки=стр_ТЧ_док_БЯС.МестоОтгрузки;
						новаяСтрока.КоличествоКоробок=стр_ТЧ_док_БЯС.КоличествоКоробок;
					КонецЕсли;	
				КонецЦикла;
				//Заполняем ТЧ  ДокументыРасхода
				Для Каждого стр_ТЧ_док_БЯС из док_БЯС.ДокументыРасхода Цикл
					новаяСтрока=ДокументыРасхода.Добавить();
					новаяСтрока.Док=стр_ТЧ_док_БЯС.Док;
					новаяСтрока.ДокНомер=стр_ТЧ_док_БЯС.ДокНомер;
					новаяСтрока.Комментарий=стр_ТЧ_док_БЯС.Комментарий;
					новаяСтрока.Проверен=стр_ТЧ_док_БЯС.Проверен;
					новаяСтрока.СчетФ=стр_ТЧ_док_БЯС.СчетФ;
					новаяСтрока.ШК=стр_ТЧ_док_БЯС.ШК;
					новаяСтрока.Сумма=стр_ТЧ_док_БЯС.Сумма;
					новаяСтрока.КолПозиций=стр_ТЧ_док_БЯС.КолПозиций;
					новаяСтрока.Количество=стр_ТЧ_док_БЯС.Количество;
					новаяСтрока.Объем=стр_ТЧ_док_БЯС.Объем;
					новаяСтрока.Вес=стр_ТЧ_док_БЯС.Вес;
					новаяСтрока.АдресДоставки=стр_ТЧ_док_БЯС.АдресДоставки;
				КонецЦикла;
				
				Коробки = МестаОтгрузки.Итог("КоличествоКоробок");
				//Изменяем Док БЯС (Перепроводим)
				ДокОбъект=док_БЯС.ПолучитьОбъект();
				Если Не ЗначениеЗаполнено(ДокОбъект.КонецОтгрузки) Тогда
					ДокОбъект.КонецОтгрузки=ТекущаяДата();
				КонецЕсли;
				ДокОбъект.ВходитВКомплект=Истина;
				ДокОбъект.КомплектБЯС=Ссылка;
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			//**********************************//
			
		 КонецЕсли;
 
	 КонецЕсли;
	//************* КОМПЛЕКТ **********************// 

	Если ЭтотОбъект.МестаОтгрузки.Количество()=0 тогда
		Если ЭтотОбъект.Направление.Код<>"100" тогда
			Если ЭтотОбъект.Коробки=0 Тогда 
				ЭтотОбъект.Коробки=1;
			КонецЕсли;	
			 Стр=ЭтотОбъект.МестаОтгрузки.Добавить();
			 Стр.КоличествоКоробок=1;
			 Стр.МестоОтгрузки=Справочники.МестаХранения.НайтиПоКоду("000001051");
		КонецЕсли;	
	КонецЕсли;	
		
		//******************* Проверка на ШК  Для АСК и НФС ****************************//
   
  
	Для Каждого Стр из ЭтотОбъект.ДокументыРасхода Цикл
		
		Если СокрЛП(Стр.ШК)="" Тогда
			//ПолучитШК  Дельфи	
			Попытка
				//Стр.ШК=модСерверПолныеПрава.ПолучитьШК_Дельфи(СокрЛП(Стр.СчетФ),СокрЛП(ЭтотОбъект.Организация));
				Стр.ШК=модСерверПолныеПрава.ПолучитьШК_ДельфиПоНомеруРасходногоОрдера(СокрЛП(Стр.ДокНомер),СокрЛП(ЭтотОбъект.Организация));
			Исключение
			КонецПопытки;
		КонецЕсли;	
		
	КонецЦикла;
	
	//Если  ВнешниеИсточникиДанных.SRVGLOB.ПолучитьСостояние()=СостояниеВнешнегоИсточникаДанных.Подключен Тогда
	//	ВнешниеИсточникиДанных.SRVGLOB.РазорватьСоединение();
	//КонецЕсли;
	
//*******************************************************************//

	Если ЗначениеЗаполнено(Коробки) Тогда
		Если не ЗначениеЗаполнено(ЭтотОбъект.НачалоОтгрузки) Тогда
			ЭтотОбъект.НачалоОтгрузки=ТекущаяДата();
		КонецЕсли;
	КонецЕсли;
	
	
	//Установка Коментариев и мест отгрузки
	ЭтотОбъект.Комментарий="";
	ТЗкомментарий=ЭтотОбъект.ДокументыРасхода .Выгрузить();
	ТЗкомментарий.Свернуть("Комментарий");
	Для Каждого ТекСтрока Из ТЗкомментарий Цикл
		Если ЗначениеЗаполнено(ТекСтрока.Комментарий) Тогда
			ЭтотОбъект.Комментарий = ЭтотОбъект.Комментарий + ТекСтрока.Комментарий + " ;";
		КонецЕсли;
		
	КонецЦикла;
	ЭтотОбъект.СписокМестХранений="";
	Для Каждого ТекСтрока Из ЭтотОбъект.МестаОтгрузки Цикл
		ЭтотОбъект.СписокМестХранений = ЭтотОбъект.СписокМестХранений + " " + ТекСтрока.МестоОтгрузки;
	КонецЦикла;
	
	//EУстановка НомераСчетФактур, ШК, Вес, Объем
	ЭтотОбъект.НомераСФ="";
	ЭтотОбъект.Отладка="";
	ЭтотОбъект.ОбщийВес=0;
	ЭтотОбъект.ОбщийОбъем=0;
	Для Каждого Стр из ДокументыРасхода Цикл
		НомераСФ = НомераСФ + ", " + СокрЛП(Стр.СчетФ);	
		Отладка = Отладка + ", " + СокрЛП(Стр.ШК);
		 ЭтотОбъект.ОбщийВес=ЭтотОбъект.ОбщийВес+Стр.Вес;
		ЭтотОбъект.ОбщийОбъем=ЭтотОбъект.ОбщийОбъем+Стр.Объем;
     КонецЦикла;
     НомераСФ = Прав(НомераСФ,СтрДлина(НомераСФ)-2);
     Отладка = Прав(Отладка,СтрДлина(Отладка)-2);
	 Если МестаОтгрузки.Количество()>0 И НЕ ЗначениеЗаполнено(Коробки) ТОГДА
		 Отказ=Истина;
	 КонецЕсли;
	 ТМС.ОтправитьБС(Ссылка);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ТоварыНаСкладах Приход
	//Движения.ТоварыНаСкладах.Записывать = Истина;
	
	
	Движения.ЗонаОтгрузки.Записывать = Истина;
	Если ЗначениеЗаполнено(Коробки) Тогда
		Если не ЗначениеЗаполнено(ЭтотОбъект.НачалоОтгрузки) Тогда
			ЭтотОбъект.НачалоОтгрузки=ТекущаяДата();
		КонецЕсли;	
		
		Для Каждого ТекСтрокаДокументыРасхода Из МестаОтгрузки Цикл
			Движение = Движения.ЗонаОтгрузки.Добавить();
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
			Движение.Период 			= ЭтотОбъект.НачалоОтгрузки;
			Движение.ДокументПрихода	= Ссылка;
			Движение.НомерМестаОтгрузки	= ТекСтрокаДокументыРасхода.МестоОтгрузки;
			Движение.КоличествоКоробок	= ТекСтрокаДокументыРасхода.КоличествоКоробок;
			//Движение.Объем				= ОбщийОбъем;
			//Движение.Вес				= ОбщийВес;
		КонецЦикла;
		
		//Если Входит в комплект  Тогда Списываем на дату комплектаци Проводим	
		Если ВходитВКомплект Тогда
			Для Каждого ТекСтрокаДокументыРасхода Из МестаОтгрузки Цикл
				Движение = Движения.ЗонаОтгрузки.Добавить();
				Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
				Движение.ДокументПрихода	= Ссылка;
				Движение.НомерМестаОтгрузки	= ТекСтрокаДокументыРасхода.МестоОтгрузки;
				Движение.КоличествоКоробок	= ТекСтрокаДокументыРасхода.КоличествоКоробок;
				//Движение.Объем				= ОбщийОбъем;
				//Движение.Вес				= ОбщийВес;
				Если ЗначениеЗаполнено(ЭтотОбъект.КонецОтгрузки) Тогда
					Движение.Период 			= ЭтотОбъект.КонецОтгрузки;
				Иначе
					Движение.Период 			= ТекущаяДата();
					ЭтотОбъект.КонецОтгрузки	= ТекущаяДата();
				КонецЕсли;
				
				
			КонецЦикла;
			
		КонецЕсли;
		
		
		//Проверяем есть ли Погрузка В Авто
		// Если Есть то перепроводим если заполнена зона места отгрузки
		Если ЗначениеЗаполнено(ПогрузкаВАвто) Тогда
			Если МестаОтгрузки.Количество()>0 Тогда
				докПогрузка=ПогрузкаВАвто.ПолучитьОбъект();
				докПогрузка.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	Движения.РегТарыПоШК.Записывать=Истина;
	Для каждого Стр Из Тара Цикл
	
			Движение=Движения.РегТарыПоШК.Добавить();
			Движение.Период=Дата;
			Движение.Тара=Стр.Контейнер;
			Движение.Кому= Получатель ;
			Движение.НаКом="Контролер";
			Движение.Причина="Идет Сборка";
		Если МестаОтгрузки.Количество()>0 Тогда
			Движение=Движения.РегТарыПоШК.Добавить();
			Движение.Период=НачалоОтгрузки;
			Движение.Тара=Стр.Контейнер;
			Движение.Кому= Получатель ;
			Движение.НаКом="Отгрузка";
			Движение.Причина="Места "+СписокМестХранений;
		КонецЕсли;
		Если ЗначениеЗаполнено(КомплектБЯС) Тогда
			Если ЗначениеЗаполнено(КомплектБЯС.ПутевойЛист) Тогда
				Движение=Движения.РегТарыПоШК.Добавить();
				Движение.Период=КомплектБЯС.ПутевойЛист.Дата;
				Движение.Тара=Стр.Контейнер;
				Движение.Кому= Получатель ;
				Движение.НаКом="На Аптеке";
				Движение.Причина="Отвез водитель "+КомплектБЯС.ПутевойЛист.Водитель;
			КонецЕсли;
		Иначе 
			Если ЗначениеЗаполнено(ПутевойЛист) Тогда
				Движение=Движения.РегТарыПоШК.Добавить();
				Движение.Период=ПутевойЛист.Дата+1;
				Движение.Тара=Стр.Контейнер;
				Движение.Кому= Получатель ;
				Движение.НаКом="На Аптеке";
				Движение.Причина="Отвез водитель "+ПутевойЛист.Водитель;
			КонецЕсли;
		КонецЕсли;
		Если Самовывоз Тогда
			Движение=Движения.РегТарыПоШК.Добавить();
			Движение.Период=НачалоОтгрузки+3600;
			Движение.Тара=Стр.Контейнер;
			Движение.Кому= Получатель ;
			Движение.НаКом="На Аптеке";
			Движение.Причина="Самовывоз";
		КонецЕсли;
	КонецЦикла;
	ТМС.ОтправитьБС(Ссылка);
КонецПроцедуры



Процедура ПередУдалением(Отказ)
	Если ЭтоКомплект Тогда
		Сообщить("Перед Удалением выполните разборку комплекта.");
		//Отказ=Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Номер) Тогда
		НайтиНачальныйДокумент=Документы.БольшаяЯчеистаяСборка.НайтиПоНомеру("ОТГ0000000000000",ТекущаяДата());	
		Если Не ЗначениеЗаполнено(НайтиНачальныйДокумент)  Тогда
			СтандартнаяОбработка=Ложь;
			ЭтотОбъект.Номер="ОТГ0000000000000";	
		КонецЕсли;
	КонецЕсли;


КонецПроцедуры
